# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

print(f'Логическая побитовая операция "И" над числами 5 и 6 равна {5 & 6}')
print(f'Логическая побитовая операция "ИЛИ" над числами 5 и 6 равна {5 | 6}')
print(f'Логическая побитовая операция "XOR" над числами 5 и 6 равна {5 ^ 6}')
print(f'Побитовый сдвиг вправо на два знака над числом 5 равен {5 >> 2 }')
print(f'Побитовый сдвиг влево на два знака над числом 5 равен {5 << 2 }')
