# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

print("Введите номер буквы: ")
num_letter = int(input())
print(f'Это буква "{chr(num_letter + 96)}"')
