# Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.

count = 0
digit = input('Введите цифру: ')
print('Для завершения подсчета введите любой символ кроме числа')

while True:
    number = input('Введите число: ')

    if number.isdigit():
        for i in number:
            if i == digit:
                count += 1
    else:
        break

print(f'Указанная цифра встретилась {count} раз(а)')

