# Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран.
# Например, если введено число 3486, надо вывести 6843.

# Первая версия функции
def reverse_number_1(num):
    if num // 10 == 0:
        return num % 10
    return num % 10, reverse_number_1(num // 10)


# Версия вторая, используется дополнительная переменная для корректного вывода
def reverse_number_2(num, i):
    if num == 0:
        return i
    else:
        return reverse_number_2(num // 10, i * 10 + num % 10)


num = int(input('Введите целое число для его реверсного разворота: '))
print(f'Реверсная версия числа "{reverse_number_2(num, 0)}"')
